aheadtest/4.4.229_native/fio_1Mread1.log
test: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=9209: Thu Nov  5 19:40:15 2020
   read: IOPS=107, BW=107MiB/s (113MB/s)(62.9GiB/600104msec)
    clat (usec): min=208, max=7128.5k, avg=9267.03, stdev=67428.87
     lat (usec): min=209, max=7128.5k, avg=9268.80, stdev=67428.87
    clat percentiles (usec):
     |  1.00th=[    245],  5.00th=[    302], 10.00th=[    306],
     | 20.00th=[    318], 30.00th=[    326], 40.00th=[    334],
     | 50.00th=[    338], 60.00th=[    351], 70.00th=[    367],
     | 80.00th=[    396], 90.00th=[    457], 95.00th=[  33817],
     | 99.00th=[ 217056], 99.50th=[ 341836], 99.90th=[ 843056],
     | 99.95th=[1149240], 99.99th=[1904215]
   bw (  KiB/s): min= 2043, max=3067912, per=100.00%, avg=124495.06, stdev=346044.39, samples=1060
   iops        : min=    1, max= 2996, avg=121.48, stdev=337.95, samples=1060
  lat (usec)   : 250=1.44%, 500=90.39%, 750=1.03%, 1000=0.03%
  lat (msec)   : 2=0.08%, 4=0.14%, 10=0.44%, 20=0.66%, 50=1.52%
  lat (msec)   : 100=1.61%, 250=1.82%, 500=0.58%, 750=0.14%, 1000=0.06%
  cpu          : usr=0.06%, sys=6.36%, ctx=106849, majf=0, minf=2408
  IO depths    : 1=100.1%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=64452,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=107MiB/s (113MB/s), 107MiB/s-107MiB/s (113MB/s-113MB/s), io=62.9GiB (67.6GB), run=600104-600104msec