aheadtest/4.4.229_native/fio_4Kread1.log
test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=8897: Thu Nov  5 19:30:01 2020
   read: IOPS=28.0k, BW=110MiB/s (115MB/s)(64.2GiB/600113msec)
    clat (nsec): min=1885, max=4391.8M, avg=29709.49, stdev=3234911.93
     lat (usec): min=2, max=4391.8k, avg=31.07, stdev=3234.91
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[    9], 99.50th=[   16], 99.90th=[   29], 99.95th=[   41],
     | 99.99th=[80217]
   bw (  KiB/s): min=  312, max=587752, per=100.00%, avg=120634.38, stdev=152047.13, samples=1116
   iops        : min=   78, max=146938, avg=30158.56, stdev=38011.78, samples=1116
  lat (usec)   : 2=0.01%, 4=92.83%, 10=6.27%, 20=0.63%, 50=0.23%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=5.47%, sys=22.12%, ctx=172929, majf=0, minf=214
  IO depths    : 1=100.4%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16832244,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=110MiB/s (115MB/s), 110MiB/s-110MiB/s (115MB/s-115MB/s), io=64.2GiB (68.9GB), run=600113-600113msec